Revit 2027 API
PanelScheduleTemplate.IsSwitchboardSchedule Property
 Checks to see if this object is switchboard schedule template element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSwitchboardSchedule { get; }
Public ReadOnly Property IsSwitchboardSchedule As Boolean
	Get
public:
property bool IsSwitchboardSchedule {
	bool get ();
}
member IsSwitchboardSchedule : bool with get
Property Value
Boolean
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace